/******************************************************************************/
/*                                                                            */
/* src/DynamicArray/DynamicArrayChunk.h                                       */
/*                                                                 2019/09/21 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef DYNAMICARRAY_CHUNK_H
#define DYNAMICARRAY_CHUNK_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdbool.h>

/* ライブラリヘッダ */
#include <MLib/MLib.h>
#include <MLib/MLibList.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** チャンクエントリ */
typedef struct {
    uint_t idx;     /* 動的配列インデックス */
    bool   used;    /* 使用フラグ           */
    uint_t pData[]; /* データ               */
} ChunkEntry_t;

/** チャンク */
typedef struct {
    MLibListNode_t node;    /* リンクリストノード */
    ChunkEntry_t   entry[]; /* チャンクエントリ   */
} Chunk_t;


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* チャンク追加 */
extern Chunk_t *ChunkAdd( MLibDynamicArray_t *pHandle,
                          MLibErr_t          *pErr     );


/******************************************************************************/
#endif
