/******************************************************************************/
/*                                                                            */
/* src/Util/UtilCopyMemory.c                                                  */
/*                                                                 2020/12/31 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>

/* ライブラリヘッダ */
#include <MLib/MLibUtil.h>


/******************************************************************************/
/* ライブラリ関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       メモリコピー
 * @details     pSrcからpDstにsize分をコピーする。
 *
 * @param[in]   *pDst コピー先アドレス
 * @param[in]   *pSrc コピー元アドレス
 * @param[in]   size  コピーサイズ
 *
 * @note        コピー元とコピー先はオーバーラップしてはならない。
 */
/******************************************************************************/
void MLibUtilCopyMemory( void       *pDst,
                         const void *pSrc,
                         size_t     size   )
{
    size_t offset;

    /* 1byteづつ繰り返し */
    for ( offset = 0; offset < size; offset++ ) {
        *( ( ( uint8_t * ) pDst ) + offset ) =
        *( ( ( uint8_t * ) pSrc ) + offset );
    }

    return;
}


/******************************************************************************/
/**
 * @brief       メモリコピー(memcpy互換)
 * @details     pSrcからpDstにsize分をコピーする。
 *
 * @param[in]   *pDst コピー先アドレス
 * @param[in]   *pSrc コピー元アドレス
 * @param[in]   size  コピーサイズ
 *
 * @return      コピー先アドレスを返す。
 *
 * @note        コピー元とコピー先はオーバーラップしてはならない。
 */
/******************************************************************************/
void *MLibUtilCopyMemoryCmpt( void       *pDst,
                              const void *pSrc,
                              size_t     size   )
{
    MLibUtilCopyMemory( pDst, pSrc, size );

    return pDst;
}


/******************************************************************************/
