/******************************************************************************/
/*                                                                            */
/* src/Spin/SpinInit.c                                                        */
/*                                                                 2020/07/18 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ライブラリ */
#include <string.h>

/* ライブラリヘッダ */
#include <MLib/MLibSpin.h>


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       スピンロック初期化
 * @details     スピンロックのハンドルを初期化する。
 *
 * @param[in]   *pHandle スピンロックハンドル
 * @param[out]  *pErr    エラー要因
 *                  - MLIB_ERR_NONE  エラー無し
 *                  - MLIB_ERR_PARAM パラメータ不正
 *
 * @return      初期化結果を返す。
 * @retval      MLIB_RET_SUCCESS 成功
 * @retval      MLIB_RET_FAILURE 失敗
 */
/******************************************************************************/
MLibRet_t MLibSpinInit( MLibSpin_t *pHandle,
                        MLibErr_t  *pErr     )
{
    /* エラー要因初期化 */
    MLIB_SET_IFNOT_NULL( pErr, MLIB_ERR_NONE );

    /* パラメータチェック */
    if ( pHandle == NULL ) {
        /* 不正 */

        /* エラー要因設定 */
        MLIB_SET_IFNOT_NULL( pErr, MLIB_ERR_PARAM );

        return MLIB_RET_FAILURE;
    }

    /* ハンドル初期化 */
    memset( pHandle, 0, sizeof ( MLibSpin_t ) );
    pHandle->lock = MLIB_SPIN_UNLOCKED;

    return MLIB_RET_SUCCESS;
}


/******************************************************************************/
