/******************************************************************************/
/*                                                                            */
/* src/Spin/SpinLock.c                                                        */
/*                                                                 2020/07/14 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>

/* ライブラリヘッダ */
#include <MLib/MLibSpin.h>


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       スピンロック
 * @details     スピンロックを試みる。ロック獲得できない場合は獲得できるまで繰
 +*             り返し試みる。
 *
 * @param[in]   *pHandle スピンロックハンドル
 * @param[out]  *pErr    エラー要因
 *                  - MLIB_ERR_NONE     エラー無し
 *                  - MLIB_ERR_PARAM    パラメータ不正
 *
 * @return      初期化結果を返す。
 * @retval      MLIB_RET_SUCCESS 成功
 * @retval      MLIB_RET_FAILURE 失敗
 */
/******************************************************************************/
MLibRet_t MLibSpinLock( MLibSpin_t *pHandle,
                        MLibErr_t  *pErr     )
{
    uint32_t lock;  /* ロック値 */

    /* 初期化 */
    lock = MLIB_SPIN_LOCKED;

    /* エラー要因初期化 */
    MLIB_SET_IFNOT_NULL( pErr, MLIB_ERR_NONE );

    /* パラメータチェック */
    if ( pHandle == NULL ) {
        /* 不正 */

        /* エラー要因設定 */
        MLIB_SET_IFNOT_NULL( pErr, MLIB_ERR_PARAM );

        return MLIB_RET_FAILURE;
    }

    /* ロック獲得するまで繰り返し */
    do {
        /* ロック */
        __asm__ __volatile__ (
            "mov  eax, 1;"              /* ロック値       */
            "xchg eax, %1"              /* ロック         */
            : "=a" ( lock )             /* 出力オペランド */
            : "m"  ( pHandle->lock ) ); /* 入力オペランド */

    /* ロック済判定 */
    } while ( lock == MLIB_SPIN_LOCKED );

    return MLIB_RET_SUCCESS;
}


/******************************************************************************/
