/******************************************************************************/
/*                                                                            */
/* src/Wrapper/WrapperInit.c                                                  */
/*                                                                 2020/12/31 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#ifndef MLIB_FE
    #include <stdlib.h>
    #include <string.h>
#endif

/* ライブラリヘッダ */
#include <MLib/MLibUtil.h>
#include <MLib/MLibWrapper.h>


/******************************************************************************/
/* グローバル変数定義                                                         */
/******************************************************************************/
/** ラッパー関数テーブル */
MLibWrapperFunc_t gWrapperFunc =
    {
#ifdef MLIB_FE
        MLibUtilCopyMemoryCmpt, /* memcpy */
        MLibUtilSetMemoryCmpt,  /* memset */
        NULL,                   /* malloc */
        NULL                    /* free   */
#else
        memcpy,                 /* memcpy */
        memset,                 /* memset */
        malloc,                 /* malloc */
        free                    /* free   */
#endif
    };


/******************************************************************************/
/* ライブラリ関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       Wrapper初期化
 * @details     ラッパー関数を登録する。
 *
 * @param[in]   ラッパー関数テーブル
 */
/******************************************************************************/
void MLibWrapperInit( MLibWrapperFunc_t func )
{
    gWrapperFunc = func;

    return;
}


/******************************************************************************/
