/******************************************************************************/
/* src/Split/SplitTerm.c                                                      */
/*                                                                 2019/01/13 */
/* Copyright (C) 2019 Mochi.                                                  */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdlib.h>

/* ライブラリヘッダ */
#include <MLib/MLib.h>
#include <MLib/MLibSplit.h>


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief           文字列分割終了処理
 * @details         分割した文字列の操作用ハンドルを解放する。
 *
 * @param[in,out]   **ppHandle ハンドル
 * @param[out]      *pErrNo    エラー番号
 *                             - MLIB_SPLIT_ERR_NONE  エラー無し
 *                             - MLIB_SPLIT_ERR_PARAM パラメータエラー
 *
 * @return          処理結果を返す。
 * @retval          MLIB_SUCCESS 成功
 * @retval          MLIB_FAILURE 失敗
 */
/******************************************************************************/
MLibRet_t MLibSplitTerm( MLibSplitHandle **ppHandle,
                         uint32_t        *pErrNo     )
{
    /* パラメータ判定 */
    if ( ppHandle == NULL ) {
        /* 不正 */

        /* エラー番号設定 */
        MLIB_SET_IFNOT_NULL( pErrNo, MLIB_SPLIT_ERR_PARAM );

        return MLIB_FAILURE;
    }

    /* ハンドル解放 */
    free( *ppHandle );

    /* エラー番号設定 */
    MLIB_SET_IFNOT_NULL( pErrNo, MLIB_SPLIT_ERR_NONE );

    return MLIB_SUCCESS;
}


/******************************************************************************/
