/******************************************************************************/
/*                                                                            */
/* src/Split/SplitTerm.c                                                      */
/*                                                                 2020/07/19 */
/* Copyright (C) 2019-2020 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdlib.h>

/* ライブラリヘッダ */
#include <MLib/MLib.h>
#include <MLib/MLibSplit.h>


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief           文字列分割終了処理
 * @details         分割した文字列の操作用ハンドルを解放する。
 *
 * @param[in,out]   **ppHandle ハンドル
 * @param[out]      *pErr      エラー要因
 *                             - MLIB_ERR_NONE  エラー無し
 *                             - MLIB_ERR_PARAM パラメータ不正
 *
 * @return          処理結果を返す。
 * @retval          MLIB_RET_SUCCESS 成功
 * @retval          MLIB_RET_FAILURE 失敗
 */
/******************************************************************************/
MLibRet_t MLibSplitTerm( MLibSplit_t **ppHandle,
                         MLibErr_t   *pErr       )
{
    /* エラー要因設定 */
    MLIB_SET_IFNOT_NULL( pErr, MLIB_ERR_NONE );

    /* パラメータ判定 */
    if ( ppHandle == NULL ) {
        /* 不正 */

        /* エラー要因設定 */
        MLIB_SET_IFNOT_NULL( pErr, MLIB_ERR_PARAM );

        return MLIB_RET_FAILURE;
    }

    /* ハンドル解放 */
    free( *ppHandle );

    return MLIB_RET_SUCCESS;
}


/******************************************************************************/
