/******************************************************************************/
/*                                                                            */
/* src/State/StateGet.c                                                       */
/*                                                                 2020/07/19 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* ライブラリヘッダ */
#include <MLib/MLib.h>
#include <MLib/MLibState.h>


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       状態取得
 * @details     状態を取得する。
 *
 * @param[in]   *pHandle 状態遷移ハンドル
 * @param[out]  *pErr    エラー要因
 *                  - MLIB_ERR_NONE  エラー無し
 *                  - MLIB_ERR_PARAM パラメータ不正
 *
 * @return      状態を返す。
 * @retval      MLIB_STATE_NULL     異常終了
 * @retval      MLIB_STATE_NULL以外 状態番号
 */
/******************************************************************************/
MLibStateNo_t MLibStateGet( MLibState_t *pHandle,
                            MLibErr_t   *pErr     )
{
    /* エラー要因初期化 */
    MLIB_SET_IFNOT_NULL( pErr, MLIB_ERR_NONE );

    /* 状態遷移ハンドルチェック */
    if ( pHandle == NULL ) {
        /* 不正 */

        /* エラー要因設定 */
        MLIB_SET_IFNOT_NULL( pErr, MLIB_ERR_PARAM );

        return MLIB_STATE_NULL;
    }

    return pHandle->state;
}


/******************************************************************************/
