/******************************************************************************/
/*                                                                            */
/* src/State/StateSet.c                                                       */
/*                                                                 2019/06/21 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* ライブラリヘッダ */
#include <MLib/MLib.h>
#include <MLib/MLibState.h>


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief         状態設定
 * @details       状態遷移ハンドル(*pHandle)が管理する状態遷移に状態(state)を設
 *                定する。
 *
 * @param[in/out] *pHandle 状態遷移ハンドル
 * @param[in]     state    状態
 * @param[out]    *pErrNo  エラー番号
 *                    - MLIB_STATE_ERR_NONE  エラー無し
 *                    - MLIB_STATE_ERR_PARAM パラメータエラー
 *
 * @return        処理結果を返す。
 * @retval        MLIB_SUCCESS 正常終了
 * @retval        MLIB_FAILURE 異常終了
 */
/******************************************************************************/
MLibRet_t MLibStateSet( MLibStateHandle_t *pHandle,
                        MLibState_t       state,
                        uint32_t          *pErrNo   )
{
    /* 初期化 */
    MLIB_SET_IFNOT_NULL( pErrNo, MLIB_STATE_ERR_NONE );

    /* 状態遷移ハンドルチェック */
    if ( pHandle == NULL ) {
        /* 不正 */

        /* エラー番号設定 */
        MLIB_SET_IFNOT_NULL( pErrNo, MLIB_STATE_ERR_PARAM );

        return MLIB_FAILURE;
    }

    /* 状態設定 */
    pHandle->state = state;

    return MLIB_SUCCESS;
}


/******************************************************************************/

