/******************************************************************************/
/*                                                                            */
/* src/State/StateGet.c                                                       */
/*                                                                 2019/06/21 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* ライブラリヘッダ */
#include <MLib/MLib.h>
#include <MLib/MLibState.h>


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       状態取得
 * @details     状態遷移ハンドル(*pHandle)が管理する状態遷移の状態を取得する。
 *
 * @param[in]   *pHandle 状態遷移ハンドル
 * @param[out]  *pErrNo  エラー番号
 *                  - MLIB_STATE_ERR_NONE  エラー無し
 *                  - MLIB_STATE_ERR_PARAM パラメータエラー
 *
 * @return      状態を返す。
 * @retval      MLIB_STATE_NULL     異常終了
 * @retval      MLIB_STATE_NULL以外 状態番号
 */
/******************************************************************************/
MLibState_t MLibStateGet( MLibStateHandle_t *pHandle,
                          uint32_t          *pErrNo   )
{
    /* 初期化 */
    MLIB_SET_IFNOT_NULL( pErrNo, MLIB_STATE_ERR_NONE );

    /* 状態遷移ハンドルチェック */
    if ( pHandle == NULL ) {
        /* 不正 */

        /* エラー番号設定 */
        MLIB_SET_IFNOT_NULL( pErrNo, MLIB_STATE_ERR_PARAM );

        return MLIB_STATE_NULL;
    }

    return pHandle->state;
}


/******************************************************************************/

