/******************************************************************************/
/* src/List/ListGet.c                                                         */
/*                                                                 2019/01/13 */
/* Copyright (C) 2017-2019 Mochi.                                             */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stddef.h>

/* ライブラリヘッダ */
#include <MLib/MLib.h>
#include <MLib/MLibList.h>


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       次ノード取得
 * @details     指定したノードの次のノードを連結リストから削除せずに取得する。
 *              ノードを指定しない場合は先頭ノードを取得する。
 *
 * @param[in]   *pList 連結リスト
 * @param[in]   *pNode ノード
 *
 * @return      次ノードを返す。
 * @retval      NULL     ノード無
 * @retval      NULL以外 ノード有
 */
/******************************************************************************/
MLibListNode_t *MLibListGetNextNode( MLibList_t     *pList,
                                     MLibListNode_t *pNode  )
{
    MLibListNode_t *pRet;   /* 戻り値 */

    /* 初期化 */
    pRet = NULL;

    /* 引数チェック */
    if ( pList == NULL ) {
        /* 不正 */

        return NULL;
    }

    /* ノード指定判定 */
    if ( pNode == NULL ) {
        /* 指定無 */

        /* 先頭ノード返却 */
        pRet = pList->pHead;

    } else {
        /* 指定有 */

        /* 次ノード返却 */
        pRet = pNode->pNext;
    }

    return pRet;
}


/******************************************************************************/
/**
 * @brief       前ノード取得
 * @details     指定したノードの前のノードを連結リストから削除せずに取得する。
 *              ノーを指定しない場合は最後尾ノードを取得する。
 *
 * @param[in]   *pList 連結リスト
 * @param[in]   *pNode ノード
 *
 * @return      前ノードを返す。
 * @retval      NULL     ノード無
 * @retval      NULL以外 ノード有
 */
/******************************************************************************/
MLibListNode_t *MLibListGetPrevNode( MLibList_t     *pList,
                                     MLibListNode_t *pNode  )
{
    MLibListNode_t *pRet;  /* 戻り値 */

    /* 初期化 */
    pRet = NULL;

    /* 引数チェック */
    if ( pList == NULL ) {
        /* 不正 */

        return NULL;
    }

    /* ノード指定判定 */
    if ( pNode == NULL ) {
        /* 指定無 */

        /* 最後尾ノード返却 */
        pRet = pList->pTail;

    } else {
        /* 指定有 */

        /* 前ノード返却 */
        pRet = pNode->pPrev;
    }

    return pRet;
}


/******************************************************************************/
