/******************************************************************************/
/*                                                                            */
/* src/List/ListInit.c                                                        */
/*                                                                 2020/07/19 */
/* Copyright (C) 2017-2020 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stddef.h>

/* ライブラリヘッダ */
#include <MLib/MLib.h>
#include <MLib/MLibList.h>
#include <MLib/MLibSpin.h>


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       連結リスト初期化
 * @details     連結リスト構造体の初期化を行う。
 *
 * @param[in]   *pList 連結リスト
 *
 * @return      初期化結果を返す。
 * @retval      MLIB_RET_SUCCESS 正常終了
 * @retval      MLIB_RET_FAILURE 異常終了
 */
/******************************************************************************/
MLibRet_t MLibListInit( MLibList_t *pList )
{
    /* 引数チェック */
    if ( pList == NULL ) {
        /* NULL */

        return MLIB_RET_FAILURE;
    }

    /* スピンロック初期化 */
    MLibSpinInit( &( pList->lock ), NULL );

    /* 連結リスト初期化 */
    pList->pHead = NULL;
    pList->pTail = NULL;
    pList->size  = 0;

    return MLIB_RET_SUCCESS;
}


/******************************************************************************/
