/******************************************************************************/
/*                                                                            */
/* src/include/MLib/MLibTypes.h                                               */
/*                                                                 2021/01/31 */
/* Copyright (C) 2020-2021 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
#ifndef _MLIB_TYPES_H_
#define _MLIB_TYPES_H_
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
#ifndef uint_t
typedef unsigned int uint_t;
#endif

/* 関数戻り値 */
#define MLIB_RET_SUCCESS (  0 ) /**< 正常終了 */
#define MLIB_RET_FAILURE ( -1 ) /**< 異常終了 */

/** 関数戻り値型 */
typedef int32_t MLibRet_t;

/* エラー要因 */
#define MLIB_ERR_NONE      ( 0x00000000 )   /**< エラー無し       */
#define MLIB_ERR_PARAM     ( 0x00000001 )   /**< パラメータ不正   */
#define MLIB_ERR_TRANS     ( 0x00000002 )   /**< 状態遷移不正     */
#define MLIB_ERR_NOTRANS   ( 0x00000003 )   /**< 状態遷移設定無し */
#define MLIB_ERR_NOMEMORY  ( 0x00000004 )   /**< メモリ不足       */
#define MLIB_ERR_NOENTRY   ( 0x00000005 )   /**< 該当エントリ無し */
#define MLIB_ERR_INDEX     ( 0x00000006 )   /**< インデックス無効 */
#define MLIB_ERR_LIMITOVER ( 0x00000007 )   /**< 上限超過         */
#define MLIB_ERR_FULL      ( 0x00000008 )   /**< バッファフル     */
#define MLIB_ERR_ALLOCATED ( 0x00000009 )   /**< 割当済み         */

/** エラー要因 */
typedef uint32_t MLibErr_t;


/******************************************************************************/
#endif
