/******************************************************************************/
/*                                                                            */
/* MLib/MLibSpin.h                                                            */
/*                                                                 2020/07/14 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef _MLIB_SPIN_H_
#define _MLIB_SPIN_H_
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>

/* ライブラリヘッダ */
#include "MLib.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* ロック値 */
#define MLIB_SPIN_UNLOCKED ( 0 )    /**< アンロック中 */
#define MLIB_SPIN_LOCKED   ( 1 )    /**< ロック中     */

/** スピンロックハンドル */
typedef struct {
    uint32_t lock;  /**< ロック変数 */
} MLibSpin_t;


/******************************************************************************/
/* グローバル関数プロトタイプ宣言                                             */
/******************************************************************************/
/* スピンロック初期化 */
extern MLibRet_t MLibSpinInit( MLibSpin_t *pHandle,
                               MLibErr_t  *pErr     );
/* スピンロック */
extern MLibRet_t MLibSpinLock( MLibSpin_t *pHandle,
                               MLibErr_t  *pErr     );
/* スピンアンロック */
extern MLibRet_t MLibSpinUnlock( MLibSpin_t *pHandle,
                                 MLibErr_t  *pErr     );


/******************************************************************************/
#endif
